cases/2D/discSteadyUniformFlow/triangleMesh/deltaX0.02/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0.5 0); 

boundaryField
{
    left
    {
        type            fixedValue;
	    value		    uniform (1 0.5 0);
    }
    bottom
    {
        type            fixedValue;
	    value		    uniform (1 0.5 0);
    }

    right
    {
        type            zeroGradient;      
    }
    top
    {
        type            zeroGradient;      
    }
    
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
